app/controllers/roasters_controller.rb

  def index
    @roasters = Roaster.all
---
SELECT * FROM `roasters`

  def show
    @roaster = Roaster.find(params[:id])
---
SELECT * FROM `roasters` WHERE (`roasters`.`id` = 1)

  def create
    @roaster = Roaster.new(params[:roaster])

    respond_to do |format|
      if @roaster.save
---
INSERT INTO `roasters` (`date`, `developers`, `updated_at`, `created_at`) VALUES('2013-08-02', 'h', '2013-08-02 13:08:18', '2013-08-02 13:08:18')

  def destroy
    @roaster = Roaster.find(params[:id])
    @roaster.destroy
---
SELECT * FROM `roasters` WHERE (`roasters`.`id` = 1)
DELETE FROM `roasters` WHERE `id` = 1