app/controllers/view_controller.rb

SELECT * FROM `names`
SELECT * FROM `names` WHERE (`names`.`id` = 2)
---
  def scheduler
    @people = Name.all
    people_ids = @people.collect{ |p| p.id }
    ids_assigned = []

    while people_ids.length > 0
      ids_assigned << people_ids.rand
      people_ids = (people_ids - ids_assigned)
    end

    @people_hash = {}
    count = 1

    (ids_assigned || []).each do |id|
      if @people_hash["pair#{count}"].blank?
        @people_hash["pair#{count}"] = []
      end

      dev = Name.find(id)